export const masksByCountryCode: Record<string, string> = {
  AF: '+93 799 999 999',        // Афганистан
  AL: '+355 699 999 999',       // Албания
  DZ: '+213 599 999 999',       // Алжир
  AO: '+244 999 999 999',       // Ангола
  AR: '+54 9 99 99 99 9999',    // Аргентина
  AM: '+374 99 999 999',        // Армения
  AU: '+61 499 999 999',        // Австралия
  AT: '+43 699 999 9999',       // Австрия
  AZ: '+994 599 999 999',       // Азербайджан
  BH: '+973 399 9999',          // Бахрейн
  BD: '+880 1999-999999',       // Бангладеш
  BY: '+375 29 9999999',        // Беларусь
  BE: '+32 499 99 99 99',       // Бельгия
  BZ: '+501 699-9999',          // Белиз
  BJ: '+229 999 99 99 99',      // Бенин
  BO: '+591 799-9999',          // Боливия
  BA: '+387 699 999 999',       // Босния и Герцеговина
  BR: '+55 11 99999-9999',      // Бразилия
  BG: '+359 88 9999999',        // Болгария
  KH: '+855 999 999 999',       // Камбоджа
  CA: '+1 (999) 999-9999',     // Канада
  CL: '+56 9 999 999 999',      // Чили
  CN: '+86 199 9999 9999',      // Китай
  CO: '+57 399 999 9999',       // Колумбия
  CR: '+506 799-9999',          // Коста-Рика
  HR: '+385 99 999 9999',       // Хорватия
  CU: '+53 59999-9999',         // Куба
  CY: '+357 999 999 999',       // Кипр
  CZ: '+420 799 999 999',       // Чехия
  DK: '+45 59 99 99 99',        // Дания
  DO: '+1 (809) 999-9999',      // Доминиканская Республика
  EC: '+593 999 999 999',       // Эквадор
  EG: '+20 199 999 9999',       // Египет
  EE: '+372 599 9999',          // Эстония
  FI: '+358 499 999 9999',      // Финляндия
  FR: '+33 6 99 99 99 99',      // Франция
  GA: '+241 799 999 999',       // Габон
  GE: '+995 599 999 999',       // Грузия
  DE: '+49 199 999999',         // Германия
  GH: '+233 599 999 999',       // Гана
  GI: '+350 599 99 99',         // Гибралтар
  GR: '+30 699 999 9999',       // Греция
  GT: '+502 599-9999',          // Гватемала
  GW: '+245 999 99 99 99',      // Гвинея-Бисау
  HK: '+852 59999999',          // Гонконг
  HN: '+504 999-9999',          // Гондурас
  HU: '+36 20 999 9999',        // Венгрия
  ID: '+62 899 9999 9999',      // Индонезия
  IE: '+353 89 999 9999',       // Ирландия
  IL: '+972 599 999 999',       // Израиль
  IN: '+91 999 999 9999',       // Индия
  IQ: '+964 799 999 9999',      // Ирак
  IR: '+98 999 999 9999',       // Иран
  IT: '+39 399 999 9999',       // Италия
  JM: '+1 (876) 999-9999',      // Ямайка
  JP: '+81 90-9999-9999',       // Япония
  KE: '+254 799 999 999',       // Кения
  KG: '+996 599 999 999',       // Кыргызстан
  KR: '+82 10-9999-9999',       // Южная Корея
  KW: '+965 599 9999',          // Кувейт
  KZ: '+7 (999) 999-99-99',     // Казахстан
  LA: '+856 20 9999999',        // Лаос
  LB: '+961 79 999 999',        // Ливан
  LI: '+423 799 999 999',       // Лихтенштейн
  LT: '+370 69 999 999',        // Литва
  LU: '+352 699 999 999',       // Люксембург
  LV: '+371 299 9999',          // Латвия
  MG: '+261 39 99 99 99',       // Мадагаскар
  MK: '+389 79 999 999',        // Северная Македония
  ML: '+223 799 99 99 99',      // Мали
  MM: '+95 999 999 999',        // Мьянма
  MN: '+976 999 9999',          // Монголия
  MO: '+853 69999999',          // Макао
  MR: '+222 59 999 999',        // Мавритания
  MT: '+356 799 9999',          // Мальта
  MU: '+230 599 9999',          // Маврикий
  MV: '+960 799-9999',          // Мальдивы
  M9: '+52 1 99 99 99 9999',    // Мексика
  MY: '+60 19-9999-9999',      // Малайзия
  NA: '+264 89 9999999',        // Намибия
  NG: '+234 799 999 9999',      // Нигерия
  NL: '+31 6 99 99 99 99',      // Нидерланды
  NO: '+47 499 99 999',         // Норвегия
  NP: '+977 9899-99999',        // Непал
  NZ: '+64 29 999 9999',        // Новая Зеландия
  OM: '+968 999 9999',          // Оман
  PA: '+507 699-9999',          // Панама
  PE: '+51 999 999 999',        // Перу
  PH: '+63 999 999 9999',       // Филиппины
  PK: '+92 399 999 9999',       // Пакистан
  PL: '+48 599 999 999',        // Польша
  PT: '+351 999 999 999',       // Португалия
  QA: '+974 399 9999',          // Катар
  RE: '+262 699 99 99 99',      // Реюньон
  RO: '+40 799 999 999',        // Румыния
  RS: '+381 699 999 9999',      // Сербия
  RU: '+7 (999) 999-99-99',     // Россия
  RW: '+250 79 999 999',        // Руанда
  SA: '+966 599 999 9999',      // Саудовская Аравия
  SC: '+248 299-9999',          // Сейшельские Острова
  SD: '+249 999 999 999',       // Судан
  SE: '+46 79 999 9999',        // Швеция
  SG: '+65 999 9999',           // Сингапур
  SI: '+386 699 999 999',       // Словения
  SK: '+421 999 999 999',       // Словакия
  SN: '+221 799 999 999',       // Сенегал
  SO: '+252 999 999 999',       // Сомали
  SR: '+597 799-9999',          // Суринам
  SY: '+963 999 999 999',       // Сирия
  SZ: '+268 769 999 999',       // Свазиленд
  TH: '+66 699 999 999',        // Таиланд
  TJ: '+992 999 999 999',       // Таджикистан
  TL: '+670 799 999 999',       // Восточный Тимор
  TM: '+993 699 9999',          // Туркменистан
  TN: '+216 299 999 999',       // Тунис
  TR: '+90 599 999 99 99',      // Турция
  TT: '+1 (868) 999-9999',      // Тринидад и Тобаго
  TZ: '+255 799 999 999',       // Танзания
  UG: '+256 799 999 999',       // Уганда
  UA: '+380 999 999 9999',      // Украина
  AE: '+971 599 999 9999',      // ОАЭ
  GB: '+44 7999 999999',        // Великобритания
  US: '+1 (999) 999-9999',      // США
  UY: '+598 999 99999',         // Уругвай
  UZ: '+998 999 999 999',       // Узбекистан
  VE: '+58 499-9999',           // Венесуэла
  VN: '+84 999 999 999',        // Вьетнам
  YE: '+967 799 9999',          // Йемен
  ZM: '+260 999 999 999',       // Замбия
  ZW: '+263 79 999 999',        // Зимбабве
};